Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: At build time all the capabilities found in the application will be aggregated in an instance of the `io.quarkus.deployment.Capabilities` build item that extension build steps can inject to check whether a given capability is available or not.
ja_jp: ビルド時には、アプリケーションで見つかったすべてのケイパビリティが `io.quarkus.deployment.Capabilities` ビルドアイテムのインスタンスに集約され、エクステンションビルドステップが注入して、所定のケイパビリティが利用可能かどうかをチェックできるようになります。

source: At build time on your `application.properties` file.
ja_jp: ビルド時に `application.properties` ファイルで実行します。

source: At build-time, the Chicory annotation processor will discover such annotation and generate a `K8sCel_ModuleExports` class, which provides the exported methods:
ja_jp: ビルド時に、Chicory アノテーションプロセッサーはこのアノテーションを検出し、エクスポートされたメソッドを提供する `K8sCel_ModuleExports` クラスを生成します。

source: At conferences, we often say that Quarkus is doing things differently from other frameworks and that the magic relies in its innovative build process.
ja_jp: カンファレンスでは、Quarkusは他のフレームワークとは異なることを行っており、その革新的なビルドプロセスに魔法がかかっているとよく言われます。

source: At deployment time, an extension can detect whether the application has enabled the Quarkus JFR extension by using Quarkus capabilities:
ja_jp: デプロイ時に、エクステンションは Quarkus の機能を使用して、アプリケーションが Quarkus JFR エクステンションを有効にしているかどうかを検出できます。

source: At least one of the test resources of the current test is restricted to the test class
ja_jp: 現在のテストのテストリソースの少なくとも 1 つが、テストクラスに制限されている

source: At least one of the test resources of the next test is restricted to the test class
ja_jp: 次のテストのテストリソースの少なくとも 1 つが、テストクラスに制限されている

source: At most one `@OnBinaryMessage` method: Handles the binary messages from the connected client/server.
ja_jp: 最大 1 つの `@OnBinaryMessage` メソッド: 接続されたクライアント/サーバーからのバイナリーメッセージを処理します。

source: At most one `@OnClose` method: Executed when the connection is closed.
ja_jp: 最大 1 つの `@OnClose` メソッド: 接続が閉じられたときに実行されます。

source: At most one `@OnOpen` method: Invoked when a connection is opened.
ja_jp: 最大 1 つの `@OnOpen` メソッド: 接続が開かれたときに呼び出されます。

source: At most one `@OnPingMessage` method: Handles the ping messages from the connected client/server.
ja_jp: 最大 1 つの `@OnPingMessage` メソッド: 接続されたクライアント/サーバーからの ping メッセージを処理します。

source: At most one `@OnPongMessage` method: Handles the pong messages from the connected client/server.
ja_jp: 最大 1 つの `@OnPongMessage` メソッド: 接続されたクライアント/サーバーからの pong メッセージを処理します。

source: At most one `@OnTextMessage` method: Handles the text messages from the connected client/server.
ja_jp: 最大 1 つの `@OnTextMessage` メソッド: 接続されたクライアント/サーバーからのテキストメッセージを処理します。

source: At present this can be configured to delegate to the Base ClassLoader, however the plan is for this option to go away and always have this as an isolated ClassLoader. Making this an isolated ClassLoader is complicated as it means that all the builder classes are isolated, which means that use cases that want to customise the build chains are slightly more complex.
ja_jp: 現在のところ、これはベース ClassLoader に委譲するように設定することができますが、計画ではこのオプションは廃止され、常に分離された ClassLoader として使用することになっています。これを分離型 ClassLoader にすることは、すべてのビルダクラスが分離されていることを意味するので複雑です。

source: At runtime the bytecode will be invoked in the order it is generated. This means that build step dependencies implicitly control the order that generated bytecode is run. In the example above we know that the bytecode that produces a `ServletExtensionBuildItem` will be run before the bytecode that consumes it.
ja_jp: 実行時には、生成された順にバイトコードが呼び出されます。つまり、ビルドステップの依存関係は、生成されたバイトコードが実行される順序を暗黙のうちに制御します。上の例では、 `ServletExtensionBuildItem` を生成するバイトコードが、それを消費するバイトコードよりも先に実行されることがわかっています。

source: At startup time, Quarkus analyzes declared channels to wire them together and verify that all channels are connected. Concretely, each channel creates a _reactive stream_ of messages connected to another channel's _reactive stream_ of messages. Adhering to the reactive stream protocol, the back-pressure mechanism is enforced between channels, allowing to control application resource usage and not over-commit and overloading part of the system.
ja_jp: 起動時に、Quarkus は宣言されたチャネルを分析してそれらをワイヤリングし、すべてのチャネルが接続されていることを確認します。 具体的には、各チャネルは、別のチャネルのメッセージの _リアクティブストリーム_ に接続されたメッセージの _リアクティブストリーム_ を作成します。 リアクティブストリームプロトコルに準拠し、チャネル間でバックプレッシャーメカニズムが適用され、アプリケーションリソースの使用を制御し、過剰なコミットやシステムの一部への過負荷を防ぐことができます。

source: At startup, you configure the JVM with this AOT cache file.
ja_jp: 起動時に、この AOT キャッシュファイルを使用して JVM を設定します。

source: At that point you should have the following structure:
ja_jp: この時点では、以下のような構成になっているはずです:

source: At that point, you should have the following structure:
ja_jp: その時点で、次の構造になっているはずです。

source: At that time, the https://github.com/cescoffier/quarkus-kafka-and-avro[application] was **NOT** working in native mode.
ja_jp: その時は、 https://github.com/cescoffier/quarkus-kafka-and-avro[アプリケーション] はネイティブモードで動作して **いません** でした。

source: At the beginning of the Quarkus project, we didn't have anything to properly host extensions outside of the Quarkus project, nor did we have infrastructure to, for instance, display external extensions on https://code.quarkus.io[code.quarkus.io].
ja_jp: Quarkusプロジェクトを立ち上げた当初は、Quarkusプロジェクト外のエクステンションを適切にホストするものがなく、例えば link:https://code.quarkus.io[code.quarkus.io]に外部のエクステンション を表示するインフラもありませんでした。

source: At the bytecode level, you end up with something equivalent to the following:
ja_jp: バイトコードレベルでは、以下のようなものになります。

source: At the end of the day, Quarkus won us over because it is the Java, we all know and love, but on steriods when needed, and was:
ja_jp: 結局のところ、Quarkusが私たちの心をつかんだのは、私たちが知っているJavaでありながら、必要に応じてステロイドを使用しており、そして以下のものでした:

source: At the end of the day, everyone wants to spend less time trying to hunt down some obscure setting, and more time developing the logic.
ja_jp: 結局のところ、誰もが、よくわからない設定を追い求める時間を減らし、ロジックの開発に時間をかけたいと思うものなのです。

source: At the moment no additional options are provided for further customization.
ja_jp: 現在のところ、さらなるカスタマイズのための追加オプションは提供されていません。

source: At the moment of writing, we only provide Vert.x core and Vert.x clients (MongoDB, Redis, Web client, Mqtt, and so on). We are extending the support to cover the full Vert.x stack.
ja_jp: 執筆時点では、Vert.xコアとVert.xクライアント(MongoDB、Redis、Webクライアント、Mqttなど)のみを提供しています。私たちはVert.x スタック全体をカバーするようにサポートを拡張しているところです。

source: At the moment the entire Quarkus test suite is passing with this feature enabled, and we have addressed all compatibility issues reported by users so far. Therefore, we have decided to enable this feature by default in the next Quarkus 3.35 release.
ja_jp: 現時点では、Quarkus のテストスイート全体がこの機能を有効にした状態でパスしており、これまでユーザーから報告されたすべての互換性の問題に対処しました。したがって、次の Quarkus 3.35 リリースでは、この機能をデフォルトで有効にすることに決定しました。

source: At the moment we have the following use cases for bootstrapping Quarkus:
ja_jp: 現在のところ、Quarkus のブートストラップには以下のようなユースケースがあります。

source: At the moment, Hibernate Validator does not expose an API to extract the information from this file so that we could register the appropriate classes for reflection.
ja_jp: 現時点では、Hibernate Validatorはリフレクションのために適切なクラスを登録する為にこのファイルから情報を抽出するAPIを公開していません。

source: At the moment, any single call to these methods will https://github.com/jakartaee/jsonp-api/issues/154[initialize a new `JsonProvider`], which is extremely slow. Quarkus provides a shared `JsonProvider` instance via the `JsonProviderHolder` class of the `quarkus-jsonp` extension.
ja_jp: 現時点では、これらのメソッドを1回呼び出すと、 link:https://github.com/jakartaee/jsonp-api/issues/154[新しいJsonProvider が初期化] されるため、非常に時間がかかります。 Quarkusは、 `quarkus-jsonp` エクステンションの `JsonProviderHolder` クラスを介して、共有 `JsonProvider` インスタンスを提供します。

source: At the moment, multipart response support is subject to the following limitations:
ja_jp: 現時点では、マルチパート応答のサポートには次の制限があります。

source: At the moment, the CLI is able to obtain the list of available extensions, but is not very accurate on the exact version of the extension (it uses the version found in the extension catalog).
ja_jp: 現時点では、CLI は利用可能なエクス転生のリストを取得できますが、エクステンションのバージョンについてはそれほど正確ではありません (エクステンションカタログにあるバージョンを使用)。

source: At the moment, when JSON-B or Jackson tries to get the list of fields of a class, if the class is not registered for reflection, no exception will be thrown. GraalVM will return an empty list of fields.
ja_jp: 現時点では、JSON-B や Jackson がクラスのフィールドのリストを取得しようとしたときに、そのクラスがリフレクションに登録されていない場合、例外は出力されません。 GraalVM は空のフィールドのリストを返します。

source: At the moment, when JSON-B or Jackson tries to get the list of fields of a class, if the class is not registered for reflection, no exception will be thrown. GraalVM will simply return an empty list of fields.
ja_jp: 現時点では、JSON-BやJacksonがクラスのフィールドのリストを取得しようとしたときに、そのクラスがリフレクションに登録されていない場合、例外はスローされません。GraalVMは単に空のフィールドのリストを返します。

source: At the prompt, the user enters their user credentials.
ja_jp: プロンプトで、ユーザーは自分のユーザークレデンシャルを入力します。

source: At this injection point `greetingConfiguration` will use the `greeting` prefix since that is what has been defined on `@ConfigProperties`.
ja_jp: この注入ポイントでは、 `greetingConfiguration` は `@ConfigProperties` で定義されている `greeting` の接頭辞を使用します。

source: At this injection point `otherConfiguration` will use the `other` prefix from `@ConfigPrefix` instead of the `greeting` prefix. Notice that in this case `@Inject` is not required.
ja_jp: この注入ポイントでは、 `otherConfiguration` は、 `greeting` の接頭辞の代わりに `@ConfigPrefix` から `other` の接頭辞を使用します。この場合、 `@Inject` は必須ではないことに注意してください。

source: At this point the extension does not expose additional configuration properties.
ja_jp: Quarkusの設定プロパティーを使用して、複数の永続化ユニットを定義することができます。

source: At this point we decided to take the plunge but, rather than retrofit our existing platform, we would start from a clean slate. At the same time, we would push the envelope further and completely overhaul our CI/CD process, clusters, and most importantly, our developer culture.
ja_jp: この時点で、私たちは思い切って既存のプラットフォームを改造するのではなく、白紙の状態からスタートすることにしました。同時に、限界に挑戦し、CI/CDプロセス、クラスター、そして最も重要な開発者の文化を全面的に見直すことにしました。

source: At this point you can run the application with Quarkus dev mode:
ja_jp: この時点で、Quarkus 開発モードでアプリケーションを実行できます。

source: At this point, Quarkus uses the Infinispan Dev Service to run an Infinispan server and configure the application. However, in production, you will run your own Infinispan (or Red Hat Data Grid).
ja_jp: この時点で、QuarkusはInfinispan Dev Serviceを使用して、Infinispanサーバーを実行し、アプリケーションを設定しています。しかし、実稼働環境では、独自のInfinispan（またはRed Hat Data Grid）を実行することになります。

source: At this point, Quarkus uses the Redis Dev Service to run a Redis server and configure the application. However, in production, you will run your own Redis (or used a Cloud offering).
ja_jp: この時点で、QuarkusはRedis Dev Serviceを使用して、Redisサーバーを実行し、アプリケーションを構成しています。 しかし、本番環境では、独自のRedisを実行することになります（または、クラウドサービスを使用します）。

source: At this point, if you prefer, you can continue learning working with Quarkus, while keeping your existing Veert.x OIDC code.
ja_jp: この時点で、必要であれば、既存の Vert.x OIDC のコードを維持したまま、Quarkus の学習を続けることができます。

source: At this point, platform properties are only allowed to provide the default values for a restricted set of configuration options. The property names in the platform properties file must be prefixed with the `platform.` suffix.
ja_jp: この時点では、プラットフォームプロパティは、制限された設定オプションのセットに対してデフォルト値を提供することのみが許可されています。プラットフォームプロパティファイルのプロパティ名の前には、 `platform.` という接尾辞を付けなければなりません。

source: At this point, the `quarkus:update` goal does not actually apply the recommended updates but simply reports what they are and how to apply them manually.
ja_jp: この時点で、 `quarkus:update` のゴールは、推奨される更新を実際に適用するのではなく、単にその内容と手動で適用する方法を報告します。

source: At this point, the only SBOM generator available for Quarkus users that can manifest application distributions is `io.quarkus:quarkus-cyclonedx`. Once it's added as a project dependency it will generate SBOMs every time an application is built. SBOMs will be saved in the project's build output directory under `<executable-name>-cyclonedx.<format>` name, where
ja_jp: 現時点で Quarkus ユーザーが利用できる、アプリケーションディストリビューションのマニフェストを作成できる唯一の SBOM ジェネレーターは `io.quarkus:quarkus-cyclonedx` です。これをプロジェクトの依存関係として追加すると、アプリケーションがビルドされるたびに SBOM が生成されます。SBOM は、プロジェクトのビルド出力ディレクトリーに `<executable-name>-cyclonedx.<format>` の名前で保存されます。

source: At this point, the token is not verified when proactive authentication is disabled.
ja_jp: この時点では、プロアクティブ認証が無効な場合、トークンは検証されません。

source: At this point, we expose a single REST method that will show a list of coffee samples in a JSON format. Note that we introduced some fault making code in our `CoffeeResource#maybeFail()` method, which is going to cause failures in the `CoffeeResource#coffees()` endpoint method in about 50 % of requests.
ja_jp: この時点で、コーヒーサンプルのリストを JSON 形式で表示する単一の REST メソッドを公開しています。 `CoffeeResource#maybeFail()` メソッドにいくつかの障害を発生させるコードを導入したことに注意してください。これにより、リクエストの約 50 % で `CoffeeResource#coffees()` エンドポイントメソッドに障害が発生します。

source: At this point, you might be thinking: "Why not just go native for everything?". For all the reasons <<graalvm,we've outlined>>, use native when it makes sense for you.
ja_jp: この時点で、「すべてをネイティブにしないのはなぜだろう？」と考えているかもしれません。<<graalvm,私たちが概説した>> すべての理由から、あなたにとって意味のある場合にネイティブを使用してください。

source: At this point, you need to know the name of the Keycloak realm, for example, `quarkus`, and, assuming that the Keycloak SAML broker alias is `saml`, enter the endpoint address as `http://localhost:8081/realms/quarkus/broker/saml/endpoint`.
ja_jp: この時点で、Keycloak レルムの名前 (例: `quarkus`) を知っておく必要があります。Keycloak SAML ブローカーのエイリアスが `saml` であると仮定して、エンドポイントアドレスを `http://localhost:8081/realms/quarkus/broker/saml/endpoint` と入力します。

source: At this point, you should have understood that most of the magic will happen at the Augmentation build time thanks to the deployment module.
ja_jp: この時点で、このデプロイメントモジュールにより、多くのマジックは拡張ビルド時に起こることを理解しているはずです。

source: At this point, you should have understood that most of the magic will happen at the Augmentation build time, thanks to the deployment module.
ja_jp: この時点で、デプロイメント モジュールのおかげで、ほとんどのマジックがオーグメンテーション ビルド時に発生することを理解できたはずです。

source: At this point, you should have your Quarkus container image on your Azure Container Registry. To verify, run the following command:
ja_jp: この時点で、Azure Container Registry上にQuarkusコンテナーイメージがあるはずです。確認するには、次のコマンドを実行します。

source: At this stage no additional configuration is needed - by default the CSRF form field and cookie name will be set to `csrf-token`, and the filter will verify the token. But you can change these names if you would like:
ja_jp: この段階では、追加の設定は必要ありません。デフォルトでは、CSRFフォームフィールドとクッキー名は `csrf-token` に設定され、フィルタはトークンを検証します。しかし、必要であれば、これらの名前を変更することができます：

source: At this stage you can `Logout` and enter your username in the `Login` form:
ja_jp: この段階で、 `Logout` し、 `Login` のフォームにユーザー名を入力することができます:

source: At this stage you can `Logout`:
ja_jp: この段階で `Logout` できます。

source: At times, it can be useful to know how the exact time each startup task (which is the result of each bytecode recording) takes when the application is run. The simplest way to determine this information is to launch the Quarkus application with the `-Dquarkus.debug.print-startup-times=true` system property. The output will look something like:
ja_jp: 時には、アプリケーションを実行したときに、各スタートアップタスク (各バイトコードの記録結果) にかかる正確な時間を知りたい場合があります。 この情報を確認する最も簡単な方法は、 `-Dquarkus.debug.print-startup-times=true` システムプロパティーを付けて Quarkus アプリケーションを起動することです。出力は以下のようになります。

source: Attach the filter to the corresponding handler using the `filter` configuration property, located in `application.properties`:
ja_jp: `application.properties` にある `filter` 設定プロパティを使用して、対応するハンドラにフィルタをアタッチします：

source: Attaching Uber-Jar file as the main project artifact
ja_jp: Uber-Jarファイルをメインプロジェクトのアーティファクトとして添付する

source: Attaching model classes to persistence units
ja_jp: モデルクラスの永続化ユニットへのアタッチメント

source: Attachments can be created from raw bytes (as shown in the snippet) or files. Note that files are resolved from the working directory of the application.
ja_jp: 添付ファイルは、（スニペットで示したように）生のバイトまたはファイルから作成できます。ファイルは、アプリケーションのワーキングディレクトリを基準に解決されることに注意してください。

source: Attachments, inlined attachments, templating, testing and more advanced configuration are covered in the xref:mailer-reference.adoc[Mailer Reference documentation].
ja_jp: 添付ファイル、インライン化された添付ファイル、テンプレート化、テスト、より高度な設定については、 link:mailer-reference.html[Mailer Referenceドキュメント]で説明されています。

source: Attribute
ja_jp: 属性

source: Attribute (_alias_)
ja_jp: 属性 (_alias_)

source: Attribute values are resolved as follows:
ja_jp: 属性値は次のように解決されます。

source: Attributes
ja_jp: 属性

source: Attributes can be added to metrics to add dimensions, pretty much like tags in Micrometer.
ja_jp: Micrometer のタグとほぼ同じように、メトリクスに属性を追加してディメンションを追加できます。

source: Audience (`aud`) claim value
ja_jp: オーディエンス (`aud`) クレーム値

source: Augment ClassLoader
ja_jp: 拡張 ClassLoader

source: Augment the security identity. See the <<security-augmentation-request-context>> section for an example of how to augment the identity in a blocking mode.
ja_jp: セキュリティーアイデンティティーをオーグメントします。ブロッキングモードでアイデンティティーをオーグメントする方法の例については、<<security-augmentation-request-context>> セクションを参照してください。

source: Augmentation
ja_jp: 拡張

source: Augmentation ClassLoader
ja_jp: オーグメンテーション ClassLoader

source: Auth Type
ja_jp: 認証タイプ

source: Auth0 does not include the end session URL in its metadata, so complement it with manually configuring the Auth0 end session endpoint URL.
ja_jp: Auth0 はメタデータにセッション終了 URL を含めないため、Auth0 セッション終了エンドポイント URL を手動で設定して補完します。

source: Auth0 expects `client-id` in the logout request.
ja_jp: Auth0 はログアウトリクエストで `client-id` を期待します。

source: Auth0 tokens do not include any claims containing roles by default, so, first, you must customize the `Login` flow of the `Auth0` application with a custom action which will add the roles to tokens. Select `Actions/Flows/Login` in the `Auth0` dashboard, choose `Add Action/Build Custom`, name it as `AddRoleClaim`:
ja_jp: デフォルトで、Auth0 トークンにはロールを含むクレームは含まれていないため、まず、トークンにロールを追加するカスタムアクションを使用して、 `Auth0` アプリケーションの `Login` フローをカスタマイズする必要があります。 `Auth0` ダッシュボードで `Actions/Flows/Login` を選択し、 `Add Action/Build Custom` を選択し、 `AddRoleClaim` という名前を付けます。

source: Auth0 will not recognize a standard `post_logout_redirect_uri` query parameter and expects a parameter `returnTo` instead.
ja_jp: Auth0 は標準の `post_logout_redirect_uri` クエリーパラメーターを認識せず、代わりに `returnTo` パラメーターを期待します。

source: Authenticate directly to Keycloak with the name and password
ja_jp: 名前とパスワードを使用した Keycloak への直接認証

source: Authenticate with the SAML provider
ja_jp: SAML プロバイダーによる認証

source: Authenticated requests to `/logout` path will be treated as RP-inititated logout requests.
ja_jp: `/logout` パスへの認証済みリクエストは、RP 主導型ログアウトリクエストとして処理されます。

source: Authentication
ja_jp: 認証

source: Authentication after an HTTP request has completed
ja_jp: HTTP リクエストが完了した後の認証

source: Authentication completion actions
ja_jp: 認証完了アクション

source: Authentication map of the client.
ja_jp: クライアントの認証マップ。

source: Authentication mechanism
ja_jp: 認証メカニズム

source: Authentication mechanism^
ja_jp: 認証メカニズム^

source: Authentication mechanisms
ja_jp: 認証メカニズム

source: Authentication mechanisms depend on xref:security-identity-providers.adoc[Identity providers] to verify the authentication credentials and map them to a `SecurityIdentity` instance, which has the username, roles, original authentication credentials, and other attributes.
ja_jp: 認証メカニズムは、xref:security-identity-providers-concept.adoc[アイデンティティプロバイダー] に依存して認証クレデンシャルを検証し、ユーザー名、ロール、元の認証クレデンシャル、およびその他の属性を持つ `SecurityIdentity` インスタンスにマッピングします。

source: Authentication mechanisms in Quarkus
ja_jp: Quarkusの認証メカニズム

source: Authentication parameter of the client.
ja_jp: クライアントの認証パラメータ。

source: Authentication requirement
ja_jp: 認証要件

source: Authentication requirements and mechanisms
ja_jp: 認証要件とメカニズム

source: Authentication settings of the client.
ja_jp: クライアントの認証設定。

source: Authentication with OAuth
ja_jp: OAuth を使用した認証

source: Authoring the DMN model
ja_jp: DMNモデルのオーサリング

source: Authorization
ja_jp: 認可

source: Authorization Code Flow
ja_jp: 認可コードフロー

source: Authorization Code Flow authentication mechanism
ja_jp: 認可コードフロー認証メカニズム

source: Authorization Code Grant
ja_jp: 認可コード グラント

source: Authorization checks for `quarkus.http.auth.` configurations are performed before security checks for standard security annotations. Therefore, `@PermitAll` only permits access to paths that are not already restricted by HTTP permissions. `@PermitAll` cannot override HTTP-level security configurations, only relax restrictions imposed by other standard security annotations such as `@RolesAllowed`.
ja_jp: `quarkus.http.auth.` 設定の認可チェックは、標準セキュリティーアノテーションのセキュリティーチェックの前に実行されます。そのため、 `@PermitAll` は、HTTP 権限によってまだ制限されていないパスへのアクセスのみを許可します。 `@PermitAll` は HTTP レベルのセキュリティー設定をオーバーライドすることはできません。 `@RolesAllowed` などの他の標準セキュリティーアノテーションによって課せられた制限を緩和するだけです。

source: Authorization code flow
ja_jp: 認可コードフロー

source: Authorization code flow completion
ja_jp: 認可コードフローの完了

source: Authorization code flow completion properties
ja_jp: 認可コードフロー完了設定プロパティー

source: Authorization code flow cookies
ja_jp: 認可コードフローの Cookie

source: Authorization code flow error properties
ja_jp: 認可コードフローエラー設定プロパティー

source: Authorization code flow errors
ja_jp: 認可コードフローのエラー

source: Authorization code flow initiation
ja_jp: 認可コードフローの開始

source: Authorization code flow is a complex, multi-step process which may work with a few properties only but require a lot of tuning to deal with the specific OIDC or OAuth2 provider's implementation and deployment constraints.
ja_jp: 認可コードフローは、少数のプロパティーだけで動作する場合もありますが、特定の OIDC または OAuth2 プロバイダーの実装やデプロイメントの制約に対処するために多くの調整が必要になる、複雑でマルチステップのプロセスです。

source: Authorization code flow is not always completed successfully. The user may cancel the authentication challenge or fail to provide the correct credentials. In such cases, instead of the `code` parameter, the `error` and `error_description` parameters are returned to Quarkus.
ja_jp: 認可コードフローが常に正常に完了するとは限りません。ユーザーが認証チャレンジをキャンセルしたり、正しいクレデンシャルの提供に失敗したりすることがあります。このような場合、 `code` パラメーターの代わりに、 `error` と `error_description` パラメーターが Quarkus に返されます。

source: Authorization code flow mechanism in Quarkus
ja_jp: Quarkus における認可コードフローメカニズム

source: Authorization code grant
ja_jp: 認可コードグラント

source: Authorization details type (required)
ja_jp: 認可詳細タイプ (必須)

source: Authorization header
ja_jp: Authorization ヘッダー

source: Authorization is always performed on the first produced `SecurityIdentity`. For example:
ja_jp: 認可は常に、最初に生成された `SecurityIdentity` に対して実行されます。たとえば:

source: Authorization is based on user roles that are provided by the security provider. To customize these roles, a `SecurityIdentityAugmentor` can be created, see xref:security-customization.adoc#security-identity-customization[Security Identity Customization].
ja_jp: 認可は、セキュリティプロバイダが提供するユーザーロールに基づいて行われます。 これらのロールをカスタマイズするために、 `SecurityIdentityAugmentor` を作成することができます。xref:security-customization.adoc#security-identity-customization [Security Identity Customization] を参照してください。

source: Authorization is based on user roles that the security provider provides. To customize these roles, a `SecurityIdentityAugmentor` can be created, see xref:security-customization.adoc#security-identity-customization[Security Identity Customization].
ja_jp: 認可は、セキュリティ・プロバイダーが提供するユーザー・ロールに基づきます。これらのロールをカスタマイズするには、 `SecurityIdentityAugmentor` を作成することができます。 link:security-customization.html#security-identity-customization[セキュリティ・アイデンティティのカスタマイズ] を参照してください。

source: Authorization of Web Endpoints
ja_jp: ウェブエンドポイントの認可

source: Authorization of web endpoints
ja_jp: ウェブエンドポイントの認可

source: Authorization path
ja_jp: 認可パス

source: Authorization server URL
ja_jp: 認可サーバー URL

source: Authorization using Annotations
ja_jp: アノテーションを使った認可

source: Authorization using Configuration
ja_jp: 設定を利用した認可

source: Authorization using annotations
ja_jp: アノテーションを使った認可

source: Authorization using configuration
ja_jp: 設定を利用した認可

source: Authorization with multiple identities
ja_jp: 複数のアイデンティティーによる認可
